Repository: ton190/Immigration
Catalog: Resources/App.*.resx
Languages: ru

# m b1
source: Why us
ru: Почему мы

# m b2
source: Services
ru: Услуги

# m b3
source: Prices
ru: Цены

# m b4
source: Requirements
ru: Требования

# m b5
source: Why Canada
ru: Почему Канада

# m b6
source: FAQ
ru: Вопросы

# h p2
source: Questionnaire: Rate Your Chances
ru: Анкета: Оцените Ваши Шансы

# h p1
source: Rating 4.67.{0} Based on{0} 209 reviews
ru: Рейтинг 4,67.{0} На основе{0} 209 отзывов

# s1 t1
source: Working Legally with full transparency and individual approach!
ru: Легально с полной прозрачностью и индивидуальным подходом!

# s1 t2
source: We make your dream come true in obtaining a {0}Visa, Permanent Residence and Citizenship of Canada.{1}
ru: Осуществляем Вашу Мечту в получении {0}Визы, Вида на Жительство и Гражданства Канады.{1}

# s1 p1
source: 91.7% positive result
ru: 91.7% положительного результата подач

# s1 p2
source: Certified consultants and lawyers on staff
ru: В штате сертифицированные консультанты и юристы

# s1 p3
source: Our office is located in Toronto
ru: Наш офис находится в Торонто

# s1 p4
source: Get expert advice immediately at:
ru: Получите консультацию специалиста сразу в:

# s2 t1
source: Hello, my name is Irina
ru: Здравствуйте, меня зовут Ирина

# s2 t2
source: I am the CEO and Founder of Legal Visa Services
ru: Я руководитель и основатель компании Trevisa

# s2 t3
source: I declare that I take full responsibility to you for:
ru: Я заявляю и беру на себя полную ответственность перед вами за:

# s2 p1
source: - The cost of our services is published on the website. The provision of services is formalized by an official contract, it is final and will not change in the course of work.
ru: - Стоимость наших услуг опубликована на сайте. Оказание услуг оформляется официальным договором, она окончательная и не изменится в процессе работы

# s2 p2
source: - Complete transparency. We know the law and work legally. Be vigilant and work with trusted companies.
ru: - Полную прозрачность. Мы знаем закон и работаем легально. Будьте бдительны и работайте с проверенными компаниями.

# s2 p3
source: - The result - we really helping you get the documents. We have already helped 372 clients. and about 92% of applications had positive result. We will do our best to make sure you are include in this percentage, because we really want to help you!
ru: - Результат - мы реально помогаем получить Вам документы. Уже помогли с документами 372 клиентам. Около 92% подач с положительным результатом. Мы приложим все усилия,чтобы Вы были в их числе. Ведь мы действительно хотим помочь Вам!

# s2 p4
source: - We value our reputation, because 40% of our clients are recommendations. The opinion of each client is important to us.
ru: - Мы дорожим своей репутацией, ведь 40% наших клиентов - это рекомендации. Для нас важно мнение каждого клиента.

# s3 t1
source: Why choose Legal Visa Services?
ru: Почему стоит выбрать Trevisa?

# s3 t2
source: Fast and Reliable Canadian Immigration Services
ru: Быстрые и надежные услуги по иммиграции в Канаду

# s3 p1
source: Consultation
ru: Консультация

# s3 p2
source: Assessment of chances
ru: Оценка шансов

# s3 p3
source: Immigration plan
ru: Иммиграционный план

# s3 p4
source: Timeliness
ru: Своевременность

# s3 p5
source: Filling out documents
ru: Заполнение документов

# s3 p6
source: Support 24/7
ru: Поддержка 24/7

# s4 t1
source: With us you will receive documents without nerves, stress and overpayments
ru: С нами Вы получите Документы без Нервов, Стрессов и Переплат

# s4 p1t
source: Individual Approach.
ru: Каждому Индивидуальный Подход.

# s4 p1
source: Our immigration consultant will check in detail, analyze your situation and develop a solution plan.
ru: Наш иммиграционный консультант подробно проверит, проанализирует вашу ситуацию и разработает планее решения.

# s4 p2t
source: True and Detailed Information.
ru: Правдивая и Подробная Информация.

# s4 p2
source: We will provide you with truthful and detailed information. If the chances of success are small, then there is no reason to submit the application.
ru: Предоставим Вам правдивую и подробную информацию. Если шансы успеха малы то нет оснований на подачу.

# s4 p3t
source: Official contract.
ru: Официальный Договор.

# s4 p3
source: We conclude a transparent official contract, where we outline all the terms and conditions.
ru: Заключаем прозрачный официальный договор, где прописываем все условия.

# s4 p4t
source: Fixed Cost.
ru: Фиксированная Стоимость.

# s4 p4
source: The cost of services will not increase in the process of registration and waiting.
ru: Стоимость услуг не увеличится в процессе оформления и ожидания.

# s4 p5t
source: Staggered payments.
ru: Поэтапная Оплата.

# s4 p5
source: Staggered payments for our services as the result progresses.
ru: Поэтапная оплата за наши услуги по мере продвижения результата.

# s4 p6t
source: Help and Support.
ru: Помошь и Сопровождение.

# s4 p6
source: We help with flights, accommodation and adaptation.
ru: Помогаем с перелетом, жильем и адаптацией.

# s5 t1
source: Our Main Services
ru: Наши Основные услуги

# s5 t2
source: Seek immediate immigration assistance. We know what to do.
ru: Обращайтесь за оперативной иммиграционной помощью. Мы знаем, что делать.

# s5 p1t
source: Express Entry
ru: Экспресс-вьезд

# s5 p2t
source: Family Sponsorship
ru: Семейное спонсорство

# s5 p1
source: The most popular category for obtaining permanent residence. Applicants who are eligible for Express Entry can upload their profile to the federal government website.
ru: Самая популярная категория для получения ПМЖ. Кандидаты, имеющие право на участие в Express Entry, могут загрузить свой профиль на веб-сайт федерального правительства.

# s5 p2
source: Reunification of family members in Canada as part of the family sponsorship program and obtaining PR status. Canada prioritizes families who wish to reunite with their family members in Canada.
ru: Воссоеденение членов семьи в Канаде в рамках программы семейного спонсорства и получения статус PR. Канада уделяет первостепенное внимание семьям, которые хотят воссоединиться с членами своей семьи в Канаде.

# s5 p3t
source: Study Permit
ru: Учебная / Визит виза

# s5 p3
source: Canada has one of the highest standards of education. in the world! We welcome students every year to realize their dreams of studying in Canada.
ru: В Канаде один из самых высоких стандартов образования. в мире! Мы приветствуем студентов каждый год, чтобы реализовать свои мечты об учебе в Канаде. Мы подготовливаем полное заявление на получение визы временного резидента (TRV) чтобы гарантироватьнаилучшие шансы..

# s5 p4t
source: Business immigration
ru: Бизнес-иммиграция

# s5 p4
source: If you are a business person or manager wishing to immigrate to Canada, the Canadian provincial governments offer a range of options that may allow you to expedite the process of immigrating to Canada
ru: Если вы деловой человек или менеджер, желающий иммигрировать в Канаду, канадские федеральные и провинциальные правительства предлагают ряд вариантов, которые могут позволить вам ускорить процесс иммиграции в Канаду

# s5 p5t
source: Work Permit
ru: Разрешение на работу

# s5 p5
source: A work permit authorizes a foreign worker to work and earn a living in Canada. An open work permit allows individuals to work for any Canadian employer.
ru: Разрешения на работу уполномочивает иностранного работника работать и зарабатывать на жизнь в Канада. Открытые разрешения на работу разрешает физическим лицам работать на любого канадского работодателя.

# s6 t1
source: Prices
ru: Цены

# s6 p1t
source: Visitors
ru: Посетители

# s6 p1.1
source: Regular visitor - 1st time
ru: Постоянный посетитель – 1-й раз

# s6 p1.2
source: Regular visitor - renewal
ru: Постоянный посетитель - продление

# s6 p1.3
source: Supervisa for parents/grandparents - 1st time
ru: Супервиза для родителей/бабушек и дедушек - 1-й раз

# s6 p1.4
source: Supervisa for parents/grandparents - extension
ru: Супервиза для родителей/бабушек и дедушек - продление

# s6 p2t
source: Students
ru: Студенты

# s6 p2.1
source: Study Permit - 1st time
ru: Разрешение на учебу - 1-й раз

# s6 p2.2
source: Permission to study inside Canada
ru: Разрешение на учебу внутри Канады

# s6 p2.3
source: Extension of study permit
ru: Продление разрешения на учебу

# s6 p2.4
source: Postgraduate Work Permit
ru: Разрешение на работу в аспирантуре

# s6 p3t
source: Provincial nominations
ru: Провинциальные номинации

# s6 p3.1
source: Ontario, graduate student
ru: Онтарио, аспирант

# s6 p3.2
source: Manitoba, skilled worker
ru: Манитоба, квалифицированный рабочий

# s6 p3.3
source: Atlantic Pilot, Skilled Worker
ru: Атлантический пилот, квалифицированный рабочий

# s6 p4t
source: Workers
ru: Рабочие

# s6 p4.1
source: Work Permit with Valid LMIA - 1st Time
ru: Разрешение на работу с действующим LMIA – 1-й раз

# s6 p4.2
source: Work Permit with Valid LMIA – Renewal
ru: Разрешение на работу с действующим LMIA – продление

# s6 p4.3
source: Work permit where LMIA is required - 1st time
ru: Разрешение на работу, где требуется LMIA – 1-й раз

# s6 p4.4
source: Work permit where LMIA is required - inside Canada
ru: Разрешение на работу там, где требуется LMIA – внутри Канады

# s6 p4.5
source: Work permit with LMIA exemption, business category - 1st time
ru: Разрешение на работу с освобождением от LMIA, бизнес - категория – 1-й раз

# s6 p4.6
source: LMIA Exempt Work Permit, Business Category - Inside Canada
ru: Разрешение на работу с освобождением от LMIA, бизнес - категория — внутри Канады

# s6 p4.7
source: Work Permit with LMIA Exemption, Family Category - First Entry
ru: Разрешение на работу с освобождением от LMIA, семейная категория – первый въезд

# s6 p4.8
source: LMIA Exempt Work Permit, Family Category - Inside Canada
ru: Разрешение на работу с освобождением от LMIA, семейная категория – внутри Канады

# s6 p5t
source: Permanent resident
ru: ПМЖ

# s6 p5.1
source: Express Entry
ru: Work Permit with LMIA exemption, business – inside Canada

# s6 p5.2
source: Provincial Nomination
ru: Work Permit with LMIA exemption, business – inside Canada

# s6 p5.3
source: Spousal Sponsorship, Inside Canada
ru: Work Permit with LMIA exemption, business – inside Canada

# s6 p5.4
source: Spousal Sponsorship, Outside Canada
ru: Work Permit with LMIA exemption, business – inside Canada

# s6 t2
source: Please note all prices are in USD and government fees are not included.{0} These are prices for frequently requested services and for a complete list of services please contact us.
ru: Обратите внимание все цены в долларах США и государсвенные пошлины не включины.{0} Это цены на часто запрашиваемые услуги и для получения полного перечня услуг свяжитесь с нами.

# s8 t1
source: Canadian Immigration Consultant
ru: Канадский Иммиграционный Консультант

# s8 t2
source: Registration number RCIC: #R705990
ru: Регистрационный номер RCIC: #R705990

# s8 p1.1
source: Adele Golod
ru: Адель Голод

# s8 p2
source: Adele Golod -Regulated Canadian Immigrant Consultant, authorized to advise clients on regarding their chances and options for immigrating to Canada, and represent you before the Canadian immigration authorities.
ru: Адель Голод - Канадский лицензированный иммиграционный консультанр, имеющий право консультировать клиентов в отношении их шансов и опций иммиграции в Канаду, а так же представлять Ваши интересы перед канадскими иммиграционными властями.

# s8 b1
source: Order a consultation
ru: Заказать консультацию

# s9 p6
source: Police clearance certificate (PCC)
ru: Справка о несудимости (PCC)

# s9 t1
source: Key requirements for immigrating to Canada
ru: Ключевые требования для иммиграции в Канаду

# s9 t2
source: Although all programs have different criteria, for most immigration programs, there are a few general requirements for documents
ru: Несмотря на то что все программы имеют разные критерии, для большинства иммиграционных программ остается несколько общих требований к документам

# s9 p1
source: Minimum Required Documents
ru: Минимальная необходимая квалификация

# s9 p2
source: English/French proficiency test result
ru: Результат теста на знание английского/французского языка

# s9 p3
source: Accumulation of the optimal number of points
ru: Набор оптимального количества баллов

# s9 p4
source: Documents confirming work experience
ru: Документы, подтверждающие трудовой стаж

# s9 p5
source: Passing a medical examination
ru: Прохождении медкомиссии

# s10 t1
source: Start with an Estimate of the Chances
ru: Начните с Оценки Шансов

# s10 t2
source: Get {0}Immigration Specialist Advice{1} - FREE
ru: Получите {0}Kонсультацию Иммиграционного Специалиста{1} - БЕСПЛАТНО

# s10 p1.1
source: Ask any question directly at
ru: Задайте любой вопрос напрямую в:

# s10 p1.2
source: Or just send a request, you will be contacted shortly
ru: Или просто введите ваш телефон, чтобы оставить заявку

# s10 b1
source: Submit a request
ru: Отправить заявку

# s10 p1.3
source: Fill out the questionnaire to assess your chances
ru: Я согласен с условиями политики конфиденциальности

# s11 t2
source: No licensed immigration consultant can guarantee 100% success, {0}BUT{1}
ru: Ни один лицензированный иммиграционный консультант не имеет права гарантировать 100% успех, {0}НО при этом{1}

# s11 t1
source: Be careful
ru: Будьте Внимательны

# s11 p1
source: They try to sign an agreement with you, with low chances of success. Later they explain that they took money only for the analysis of documents.
ru: С Вами стараются заключить договор, при низких шансах на успех. Позже объясняют, что брали деньги только за анализ документов.

# s11 p2
source: The cost on the website is one - in the office it is already more. Special price reduction to "lure" new customers.
ru: Стоимость на сайте одна - в офисе уже больше. Специальное занижение цены, чтобы "заманить" новых клиентов.

# s11 p3
source: You will have to resubmit documents several times. Companies Make Mistakes Hidden by Fluctuating Immigration Laws
ru: Вам придется переподавать документы по нескольку раз. Компании допускают ошибки, прекрываясь изменчивым иммиграционным законодательством

# s11 t3
source: It's a fact: since 2018, we have helped 200+ clients from all over the world get documents.
ru: Это факт: с 2018 года мы помогли получить документы 200+ клиентам со всего мира.

# s12 t1
source: We are proud of what we do
ru: Мы Гордимся тем что Делаем

# s13 t1
source: Canada is the Best Immigration Solution
ru: Канада это Лучшее Решение для Иммиграции

# s13 p1
source: High Level Security
ru: Высокий Уровень Безопасности

# s13 p2
source: Economic Stability
ru: Экономическая Стабильность

# s13 p3
source: Free Medical Service
ru: Бесплатное Медицинское Обслуживание

# s13 p4
source: Social Security System
ru: Система Социального Обеспечения

# s13 p5
source: Quality and Affordable Education
ru: Качественное и Доступное Образование

# s13 p6
source: Ecologically Clean Nature
ru: Экологически Чистая Природа

# s13 p7
source: Canada - Land of Immigrants
ru: Канада - Страна Иммигрантов

# s13 p8
source: Best Country to Live in
ru: Лучшая Страна для Жизни

# s14 t1
source: Start Your Success Story
ru: Начните Свою Историю Успеха

# s14 p1.1
source: Get a free consultation and recommendations on the best options
ru: Получите бесплатную консультацию и рекомендации по лучшим вариантам

# s14 p1.2
source: How to leave to live, study or work in Canada!
ru: Как уехать жить, учиться или работать в Канаду!

# s14 b1
source: Order a consultation
ru: Заказать консультацию

# s15 t1
source: Educational Institutions - Our Partners
ru: Учебные Заведения - Наши Партнеры

# s16 t1
source: FAQ
ru: Вопросы-Ответы

# s16 p1.1
source: How does the form IMM5409 – Declaration of Common Law Partnership work? Does it expire? If the relationship is over, do I have to cancel it?
ru: Как работает форма IMM5409 – Декларация гражданского партнерства? Срок его действия истекает? Если отношения закончились, должен ли я их отменить?

# s16 p1.2
source: The form never expires, for immigration purposes it works the same way as a marriage certificate. If the relationship is over, there is no need to cancel it or process any other paperwork. If you have ever submitted an immigration application where you declared the common-law union, you have to remember not to omit it in any new applications you might submit in the future.
ru: Форма бессрочная, для иммиграционных целей она работает так же, как свидетельство о браке. Если отношения закончились, нет необходимости их отменять или оформлять какие-либо другие документы. Если вы когда-либо подавали иммиграционное заявление, в котором объявляли гражданский союз, вы должны помнить, что нельзя пропускать его в каких-либо новых заявлениях, которые вы можете подать в будущем.

# s16 p2.1
source: I am applying for a work permit outside Canada. Is it better to apply for it alone or with a dependent family?
ru: Я подаю заявление на получение разрешения на работу за пределами Канады. Лучше подавать заявление одному или с семьей на иждивении?

# s16 p3.1
source: I have a child who is Canadian citizen. Do I have to mention the child in the generic application form? Do I have to provide the baby’s photos?
ru: У меня есть ребенок, который является гражданином Канады. Должен ли я упоминать ребенка в общей форме заявления? Должен ли я предоставлять фотографии ребенка?

# s16 p4.1
source: I did my biometrics in Dec 2020, do I need to pay for them again when paying the fees? Or just submit the IRCC number of the tag they gave me when I did them?
ru: Я сдал биометрические данные в декабре 2020 года, нужно ли мне снова платить за них при оплате сборов? Или просто отправьте номер IRCC тега, который они дали мне, когда я их делал?

# s16 p5.1
source: My education and work experience are unrelated. Should I still just send my diploma and other documents to WES for the assessment, or do I have to follow another approach?
ru: Мое образование и опыт работы никак не связаны. Должен ли я по-прежнему просто отправлять свой диплом и другие документы в WES для оценки, или мне нужно следовать другому подходу?

# s17 t1
source: Contact Us
ru: Связаться с Нами

# s17 b1
source: Send
ru: Отправить

# s16 p2.2
source: This is entirely your decision, and there are pros and cons on both sides.<br> In general, it is safe to apply for the work permit as a family if your annual income, as per your job offer, is equal or higher than the double the required settlement funds for the size of your family. for instance, for a family with 2 children your gross income should be no less than @24,553*2=49,106.
ru: Это полностью ваше решение, и у обеих сторон есть свои плюсы и минусы.<br> Как правило, безопасно подавать заявление на получение разрешения на работу всей семьей, если ваш годовой доход, согласно вашему предложению о работе, равен или превышает двойную сумму необходимых расчетных средств для размера вашей семьи. например, для семьи с 2 детьми ваш валовой доход должен быть не менее @24 553*2=49 106.

# s16 p3.2
source: You have to mention the child in the application form and mark that they are not included in the application as a Canadian-born citizen. You will not have to provide the photograph for that child, but the proof of Canadian citizenship (passport of birth certificate) are necessary. If you have to provide the proof of funds (POF) in your application, the child will have to figure in the calculation.
ru: Вы должны упомянуть ребенка в анкете и отметить, что он не включен в заявление в качестве гражданина Канады. Вам не нужно будет предоставлять фотографию этого ребенка, но необходимо доказательство канадского гражданства (паспорт свидетельства о рождении). Если вы должны предоставить подтверждение средств (POF) в вашем заявлении, ребенок должен будет фигурировать в расчете.

# s16 p4.2
source: Your biometrics are linked to your UCI number and are valid for 10 years. Unless specifically requested, you do not need to do anything or upload anything.
ru: Ваши биометрические данные связаны с вашим номером UCI и действительны в течение 10 лет. Если специально запрашивается, вам не нужно ничего делать или загружать что-либо.

# s16 p5.2
source: There is no requirement or your education and work experience to be related. WES assessment gives you a certain number of points in the Express Entry system, regardless of whether you ever worked in the profession or not. Likewise, your work experience is assessed regardless of whether or not you have relevant education.
ru: Нет требований, чтобы ваше образование и опыт работы были связаны между собой. оценка ВЭС дает вам определенное количество баллов в системе Express Entry, независимо от того, работал по профессии или нет. Точно так же ваш опыт работы оценивается независимо от того, или у вас нет соответствующего образования.

# m b0
source: Home
ru: Главная

# page title
source: Immigration in to Canada
ru: Иммиграция в Канаду
